import React from 'react';
import "./about.css";

function About() {
  return (
    <div className="about-page-wrapper">
      <h1>Курсова робота з баз даних</h1>
      <h2>Автор роботи: <span className="author-name"> Денис Фундерат </span> </h2>
      <p>
        У аеропорту існує два термінали: термінал А для внутрішніх рейсів і термінал Б – для міжнародних. Пасажир прибуває до аеропорту і стає на реєстрацію до відповідного терміналу. При реєстрації перевіряються документи і авіаквиток пасажира, при міжнародному перельоті додатково перевіряється віза пасажира. Під час реєстрації додатково перевіряється, чи не є пасажир у внутрішньому або міжнародному розшуку (Інтерпол), при необхідності інформуються відповідні органи.

        В разі вдалої реєстрації відбувається оформлення і перевірка багажу. Якщо об'єм або вага багажу пасажира перевищує припустимі норми, то виписується квитанція на додаткову оплату перевезення.

        За 10 хвилин до відправки рейса реєстрація пасажирів припиняється, формується остаточний список пасажирів і багажу. На підставі сформованих списків власники авіакомпаній приймають рішення про скорочення або збільшення числа рейсів: • якщо кількість пасажирів менше заданої норми рентабельності рейсу, то приймається рішення по скороченню кількості рейсів. • якщо літак завантажений на 95%, то розглядається варіант по збільшенню частоти польотів рейсів у даному напрямі.
      </p>
    </div>
  );
}

export default About;